# Analyzing borrowers’ risk of defaulting

Our project is to prepare a report for a bank’s loan division. We’ll need to find out if a customer’s marital status and number of children has an impact on whether they will default on a loan. The bank already has some data on customers’ credit worthiness.

Our report will be considered when building the **credit score** of a potential customer. The **credit score** is used to evaluate the ability of a potential borrower to repay their loan.

In [183]:
# Loading all the libraries
import pandas as pd
try:
    credit_data = pd.read_csv("C:/Users/mrkil/Desktop/Data Analyst/credit_scoring_eng.csv") # Load the data
except:
    print('DataFrame error, check synthax/check file path')

## Open the data file and have a look at the general information.

## Task 1. Data exploration

**Description of the data**
- `children` - the number of children in the family
- `days_employed` - work experience in days
- `dob_years` - client's age in years
- `education` - client's education
- `education_id` - education identifier
- `family_status` - marital status
- `family_status_id` - marital status identifier
- `gender` - gender of the client
- `income_type` - type of employment
- `debt` - was there any debt on loan repayment
- `total_income` - monthly income
- `purpose` - the purpose of obtaining a loan

Now let's explore our data. We want to see how many columns and rows it has, look at a few rows to check for potential issues with the data

In [184]:
credit_data.info() # Let's see how many rows and columns our dataset has

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [185]:
display(credit_data.head(30))# let's print the first N rows

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,-2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,-152.779569,50,SECONDARY EDUCATION,1,married,0,M,employee,0,21731.829,education
8,2,-6929.865299,35,BACHELOR'S DEGREE,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,-2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family
10,2,-4171.483647,36,bachelor's degree,0,married,0,M,business,0,18230.959,buy real estate
11,0,-792.701887,40,secondary education,1,married,0,F,employee,0,12331.077,buy commercial real estate
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
13,0,-1846.641941,54,some college,2,married,0,F,employee,0,20873.317,car purchase
14,0,-1844.956182,56,bachelor's degree,0,civil partnership,1,F,business,1,26420.466,buy residential real estate
15,1,-972.364419,26,secondary education,1,married,0,F,employee,0,18691.345,construction of own property
16,0,-1719.934226,35,secondary education,1,married,0,F,employee,0,46272.433,property
17,0,-2369.999720,33,bachelor's degree,0,civil partnership,1,M,employee,0,14465.694,building a property
18,0,400281.136913,53,secondary education,1,widow / widower,2,F,retiree,0,9091.804,buying a second-hand car
19,0,-10038.818549,48,SECONDARY EDUCATION,1,divorced,3,F,employee,0,38852.977,buying my own car
20,1,-1311.604166,36,secondary education,1,married,0,M,employee,0,33528.423,property
21,1,-253.685166,33,secondary education,1,civil partnership,1,F,employee,0,21089.953,car purchase
22,1,-1766.644138,24,secondary education,1,civil partnership,1,F,employee,0,23948.983,buying a second-hand car
23,0,-272.981385,21,bachelor's degree,0,civil partnership,1,M,employee,0,20522.515,to have a wedding
24,1,338551.952911,57,secondary education,1,unmarried,4,F,retiree,0,46487.558,transactions with commercial real estate
25,0,363548.489348,67,secondary education,1,married,0,M,retiree,0,8818.041,buy real estate
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
27,0,-529.191635,28,bachelor's degree,0,married,0,M,employee,0,49415.837,construction of own property
28,1,-717.274324,26,bachelor's degree,0,married,0,F,employee,0,30058.118,construction of own property
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate

Let's see if there are any issues that may need further investigation and changes

<b>days_employed column has negative values, also there seems to be NaN values symmetrically both in days_employed and in total_income columns </b>
Let's get info on data

Are there missing values across all columns or just a few?

In [186]:
credit_data[credit_data['days_employed'].isna()].head(1)
# Let's look in the filtered table at the the first column with missing data

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding

Do missing values seem symmetric? Can we be sure in this assumption?

In [187]:
display(credit_data.days_employed.isna().sum()) #number of missing values in days_employed column
display(credit_data.total_income.isna().sum()) #number of missing values in total_income column
len(credit_data[(credit_data.days_employed.isna()) & (credit_data.total_income.isna())]) #number of missing values both in total_income column

# Let's apply multiple conditions for filtering data and look at the number of rows in the filtered table.

2174

2174

2174

**Intermediate conclusion**

Does the number of rows in the filtered table match the number of missing values? - 
**Yes, it does. It could probably mean, that customers with missing valuea are unemployed**

Let's now calculate the percentage of the missing values compared to the whole dataset. If it is a considerably large piece of data, we may want to fill the missing values. To do that, firstly we should consider whether the missing data could be due to the specific client characteristic, such as employment type or something else. Secondly, we should check whether there's any dependence missing values have on the value of other indicators with the columns with identified specific client characteristic.

In [188]:
# Let's investigate clients who do not have data on identified characteristic and the column with the missing values
filtered = credit_data[credit_data['total_income'].isna()]
filtered.value_counts(subset= ['income_type'])

income_type
employee         1105
business          508
retiree           413
civil servant     147
entrepreneur        1
Name: count, dtype: int64

In [189]:
# Checking distribution
((filtered.value_counts(subset= ['income_type']))/(filtered.value_counts(subset= ['income_type']).sum())).mul(100).round(1).astype(str) + '%'

income_type
employee         50.8%
business         23.4%
retiree          19.0%
civil servant     6.8%
entrepreneur      0.0%
Name: count, dtype: object

In [190]:

mis_values = credit_data.isnull().sum().to_frame('missing_values')
mis_values['%'] = round(credit_data.isnull().sum()/len(credit_data),3)
mis_values.sort_values(by='%', ascending=False)

                  missing_values      %
days_employed               2174  0.101
total_income                2174  0.101
children                       0  0.000
dob_years                      0  0.000
education                      0  0.000
education_id                   0  0.000
family_status                  0  0.000
family_status_id               0  0.000
gender                         0  0.000
income_type                    0  0.000
debt                           0  0.000
purpose                        0  0.000



**Possible reasons for missing values in data are: technical issues, unemployment of customers on the day the data was recorded**

In [191]:
# Checking the distribution in the whole dataset (% of each income_type that we have)
credit_data['income_type'].value_counts(normalize=True).mul(100).round(1).astype(str) + '%'

income_type
employee                       51.7%
business                       23.6%
retiree                        17.9%
civil servant                   6.8%
unemployed                      0.0%
entrepreneur                    0.0%
student                         0.0%
paternity / maternity leave     0.0%
Name: proportion, dtype: object

**Intermediate conclusion**

**We have found no particular pattern that would suggest that missing values are not accidental. Again,  technical issues, unemployment of customers on the day the data was recorded**

## Data transformation

Let's go through each column to see what issues we may have in them.

In [192]:
# Let's see all values in education column to check if and what spellings will need to be fixed
print(credit_data['education'].unique())

["bachelor's degree" 'secondary education' 'Secondary Education'
 'SECONDARY EDUCATION' "BACHELOR'S DEGREE" 'some college'
 'primary education' "Bachelor's Degree" 'SOME COLLEGE' 'Some College'
 'PRIMARY EDUCATION' 'Primary Education' 'Graduate Degree'
 'GRADUATE DEGREE' 'graduate degree']

In [193]:
# Fix the registers if required
credit_data['education'] = credit_data['education'].str.lower()

In [194]:
# Checking all the values in the column to make sure we fixed them

print(credit_data['education'].unique())

["bachelor's degree" 'secondary education' 'some college'
 'primary education' 'graduate degree']

Checking the data the `children` column

In [195]:
# Let's see the distribution of values in the `children` column
print(credit_data['children'].value_counts().sort_values(ascending=False))

children
 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: count, dtype: int64

In [196]:
'''Fixed the data by applying the .abs() method (thus turning the negative values into the absolute values), 
assuming that the -1 values were added to the dataframe by mistake. ''' 
credit_data['children'] = credit_data['children'].abs()
credit_data['children'] = credit_data['children'].replace(20, 2) #replacing 20 kids with 2, since it is highly unlikely, that so many people have exactly 20 kids.

In [197]:
# Checking the `children` column again to make sure it's all fixed
print(credit_data['children'].value_counts())

children
0    14149
1     4865
2     2131
3      330
4       41
5        9
Name: count, dtype: int64

Checking the data in the `days_employed` column. Firstly think about what kind of issues could there be and what you may want to check and how you will do it.

In [198]:
# Finding problematic data in `days_employed`, if they exist, and calculate the percentage

credit_data['days_employed'].describe()

count     19351.000000
mean      63046.497661
std      140827.311974
min      -18388.949901
25%       -2747.423625
50%       -1203.369529
75%        -291.095954
max      401755.400475
Name: days_employed, dtype: float64

**The data might have been added with negative values as a result of a technical issue or a mistake.**

First, let's assume, that the negative values were added due to a technical issue or a mistake and represent hours, not days.

Second, let's distribute days_employed by year categories.

In [199]:
# Addressing the problematic values, if they exist

credit_data['days_employed']=credit_data['days_employed'].abs()/24 #convertion to days

In [200]:
print(credit_data['days_employed'].describe())

count    19351.000000
mean      2788.113704
std       5792.953355
min          1.005901
25%         38.625386
50%         91.425857
75%        230.745102
max      16739.808353
Name: days_employed, dtype: float64

In [201]:
def days_employed_function (days_employed): 
    days_employed = days_employed['days_employed']
    if 0 <= days_employed < 366:
        return '0-1'
    elif 366 <= days_employed <= 1095:
        return '1-3'
    elif 1096 <= days_employed <= 3650:
        return '4-10'
    elif 3651 <= days_employed <= 10950:
        return '11-30'
    elif days_employed >= 10951:
        return '30+'
credit_data['days_employed_years'] = credit_data.apply(days_employed_function, axis=1)
display(credit_data.value_counts(subset='days_employed_years').sort_index())

days_employed_years
0-1    15478
1-3      428
30+     3445
Name: count, dtype: int64

In [202]:
# Check the result - make sure it's fixed
credit_data['days_employed'].describe()

count    19351.000000
mean      2788.113704
std       5792.953355
min          1.005901
25%         38.625386
50%         91.425857
75%        230.745102
max      16739.808353
Name: days_employed, dtype: float64

Let's now look at the client's age and whether there are any issues there. Again, think about what can data can be strange in this column, i.e. what cannot be someone's age.

In [203]:
# Checking the `dob_years` for suspicious values and count the percentage

credit_data['dob_years'].describe()

count    21525.000000
mean        43.293380
std         12.574584
min          0.000000
25%         33.000000
50%         42.000000
75%         53.000000
max         75.000000
Name: dob_years, dtype: float64

There don't seem to be any suspicious values

Now let's check the `family_status` column. See what kind of values there are and what problems you may need to address.

In [204]:
# Let's see the values for the column
credit_data['family_status'].unique()

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

Now let's check the `gender` column. See what kind of values there are and what problems you may need to address

In [205]:
credit_data['gender'].value_counts()

gender
F      14236
M       7288
XNA        1
Name: count, dtype: int64

In [206]:
# Address the problematic values, if they exist
credit_data['gender'] = credit_data['gender'].replace('XNA', 'F')

In [207]:
# Check the result - make sure it's fixed
credit_data['gender'].value_counts()

gender
F    14237
M     7288
Name: count, dtype: int64

Now let's check the `income_type` column. See what kind of values there are and what problems you may need to address

In [208]:
credit_data['income_type'].unique()# Let's see the values in the column

array(['employee', 'retiree', 'business', 'civil servant', 'unemployed',
       'entrepreneur', 'student', 'paternity / maternity leave'],
      dtype=object)

Now let's see if we have any duplicates in our data. If we do, you'll need to decide what you will do with them and explain why.

In [209]:
# Checking duplicates
credit_data.loc[credit_data.duplicated()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,days_employed_years
2849,0,NaN,41,secondary education,1,married,0,F,employee,0,NaN,purchase of the house for my family,None
3290,0,NaN,58,secondary education,1,civil partnership,1,F,retiree,0,NaN,to have a wedding,None
4182,1,NaN,34,bachelor's degree,0,civil partnership,1,F,employee,0,NaN,wedding ceremony,None
4851,0,NaN,60,secondary education,1,civil partnership,1,F,retiree,0,NaN,wedding ceremony,None
5557,0,NaN,58,secondary education,1,civil partnership,1,F,retiree,0,NaN,to have a wedding,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...
20702,0,NaN,64,secondary education,1,married,0,F,retiree,0,NaN,supplementary education,None
21032,0,NaN,60,secondary education,1,married,0,F,retiree,0,NaN,to become educated,None
21132,0,NaN,47,secondary education,1,married,0,F,employee,0,NaN,housing renovation,None
21281,1,NaN,30,bachelor's degree,0,married,0,F,employee,0,NaN,buy commercial real estate,None
21415,0,NaN,54,secondary education,1,married,0,F,retiree,0,NaN,housing transactions,None

In [210]:
# Address the duplicates, if they exist
credit_data = credit_data.drop_duplicates().reset_index(drop=True)

In [211]:
# Last check whether we have any duplicates
credit_data.duplicated().sum()

0

In [212]:
# Check the size of the dataset that you now have after your first manipulations with it
credit_data.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21454.000000,19351.000000,21454.000000,21454.000000,21454.000000,21454.000000,19351.000000
mean,0.480563,2788.113704,43.271231,0.817097,0.973898,0.081150,26787.568355
std,0.756069,5792.953355,12.570822,0.548674,1.421567,0.273072,16475.450632
min,0.000000,1.005901,0.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,38.625386,33.000000,1.000000,0.000000,0.000000,16488.504500
50%,0.000000,91.425857,42.000000,1.000000,0.000000,0.000000,23202.870000
75%,1.000000,230.745102,53.000000,1.000000,1.000000,0.000000,32549.611000
max,5.000000,16739.808353,75.000000,4.000000,4.000000,1.000000,362496.645000

In [213]:
credit_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   children             21454 non-null  int64
 1   days_employed        19351 non-null  float64
 2   dob_years            21454 non-null  int64
 3   education            21454 non-null  object
 4   education_id         21454 non-null  int64
 5   family_status        21454 non-null  object
 6   family_status_id     21454 non-null  int64
 7   gender               21454 non-null  object
 8   income_type          21454 non-null  object
 9   debt                 21454 non-null  int64
 10  total_income         19351 non-null  float64
 11  purpose              21454 non-null  object
 12  days_employed_years  19351 non-null  object
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ MB

# Working with missing values

The purpose column contains different aliases for the same name. We could standardize the values using a function.

In [214]:
# Find the dictionaries
credit_data['purpose'].unique()

array(['purchase of the house', 'car purchase', 'supplementary education',
       'to have a wedding', 'housing transactions', 'education',
       'having a wedding', 'purchase of the house for my family',
       'buy real estate', 'buy commercial real estate',
       'buy residential real estate', 'construction of own property',
       'property', 'building a property', 'buying a second-hand car',
       'buying my own car', 'transactions with commercial real estate',
       'building a real estate', 'housing',
       'transactions with my real estate', 'cars', 'to become educated',
       'second-hand car purchase', 'getting an education', 'car',
       'wedding ceremony', 'to get a supplementary education',
       'purchase of my own house', 'real estate transactions',
       'getting higher education', 'to own a car', 'purchase of a car',
       'profile education', 'university education',
       'buying property for renting out', 'to buy a car',
       'housing renovation', 'going to university'], dtype=object)

In [215]:
credit_data[credit_data['purpose']=='to have a wedding']

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,days_employed_years
4,0,14177.753002,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,30+
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding,None
23,0,11.374224,21,bachelor's degree,0,civil partnership,1,M,employee,0,20522.515,to have a wedding,0-1
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding,None
92,1,69.553320,40,bachelor's degree,0,civil partnership,1,F,employee,0,30623.674,to have a wedding,0-1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
21296,0,34.616895,34,secondary education,1,civil partnership,1,F,employee,0,10755.570,to have a wedding,0-1
21343,1,283.853776,40,secondary education,1,civil partnership,1,F,business,0,30644.216,to have a wedding,0-1
21382,1,149.344542,42,secondary education,1,civil partnership,1,F,business,0,17165.818,to have a wedding,0-1
21427,1,55.442833,32,secondary education,1,civil partnership,1,M,employee,0,38522.812,to have a wedding,0-1
21434,0,14121.036100,53,secondary education,1,civil partnership,1,M,retiree,0,12070.399,to have a wedding,30+

In [216]:
credit_data.sample(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,days_employed_years
20340,1,125.874153,30,secondary education,1,married,0,M,employee,0,22312.919,buy real estate,0-1
10220,0,33.056608,19,secondary education,1,married,0,F,employee,0,21009.404,housing renovation,0-1
21414,0,15166.518713,59,bachelor's degree,0,married,0,F,retiree,0,42720.117,buying a second-hand car,30+
13342,1,73.556323,39,bachelor's degree,0,married,0,F,business,0,17163.743,building a property,0-1
6817,2,26.853415,34,bachelor's degree,0,married,0,M,business,0,100422.296,purchase of my own house,0-1
20952,1,9.629265,57,secondary education,1,civil partnership,1,M,business,0,18342.053,purchase of the house for my family,0-1
21411,1,36.045047,25,secondary education,1,married,0,F,business,0,15050.405,to own a car,0-1
10966,0,36.217123,34,secondary education,1,civil partnership,1,M,business,0,22318.788,getting higher education,0-1
10524,2,33.526782,36,bachelor's degree,0,married,0,F,civil servant,0,32927.202,transactions with my real estate,0-1
14896,0,63.075591,53,secondary education,1,unmarried,4,F,business,0,18445.251,to get a supplementary education,0-1

In [217]:
#Let's write a function that would categorize loan purposes

In [218]:
def credit_category (purpose):
    
    if 'wedd' in purpose:
        return 'wedding'
    elif 'hous' in purpose or 'estate' in purpose or 'propert' in purpose:
        return 'house'
    elif 'car' in purpose:
        return 'car'
    elif 'educat' in purpose or 'uni' in purpose:
        return 'education'
   
    
    
credit_data['purpose_category']= credit_data['purpose'].apply(credit_category)

print(credit_data.purpose_category.value_counts())

#example = 'purchase of the car'
#credit_category(example)

purpose_category
house        10811
car           4306
education     4013
wedding       2324
Name: count, dtype: int64

### Restoring missing values in `total_income`


**Columns days_employed and total_income have missing values. It would make sense to fill missing values with either mean or median df values. Then create age categories for clients and new column with the age category.**

In [219]:
# Let's write a function that calculates the age category
def age_category (dob_years):
    if dob_years >= 0:
        if dob_years <=25:
            return '0-25'
    if dob_years >= 26:
        if dob_years <= 45:
            return '25-45'
    if dob_years >= 46:
        if dob_years <= 75:
            return '45-75'

In [220]:
# Test if the function works
age_category(45)

'25-45'

In [221]:
# Creating new column based on function
credit_data['age_categories']= credit_data['dob_years'].apply(age_category)

In [222]:
# Checking how values in the new column
print(credit_data['age_categories'].value_counts().sort_index())
print()
print(credit_data['age_categories'].describe())

age_categories
0-25      1333
25-45    10971
45-75     9150
Name: count, dtype: int64

count     21454
unique        3
top       25-45
freq      10971
Name: age_categories, dtype: object

Let's think about the factors on which income usually depends. Eventually, we want to find out whether to use mean or median values for replacing missing values. To make this decision we need to look at the distribution of the factors you identified as impacting one's income.

Creating a table that only has data without missing values. This data will be used to restore the missing values.

In [223]:
# Create a table without missing values and print a few of its rows to make sure it looks fine
credit_data_notnull = credit_data[credit_data.notnull().all(1)]
display(credit_data_notnull.head(10))

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,days_employed_years,purpose_category,age_categories
0,1,351.569709,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,0-1,house,25-45
1,1,167.700156,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,0-1,car,25-45
2,0,234.309275,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,0-1,house,25-45
3,3,171.864467,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,0-1,education,25-45
4,0,14177.753002,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,30+,wedding,45-75
5,0,38.591076,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house,0-1,house,25-45
6,0,119.966752,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions,0-1,house,25-45
7,0,6.365815,50,secondary education,1,married,0,M,employee,0,21731.829,education,0-1,education,45-75
8,2,288.744387,35,bachelor's degree,0,civil partnership,1,F,employee,0,15337.093,having a wedding,0-1,wedding,25-45
9,0,91.198185,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family,0-1,house,25-45

Now we will look multiple comparisons of the distribution of different factors.

In [224]:
# Let's look at the mean and median values for income based on the age factor
credit_data_notnull.groupby('age_categories').agg(total_income_mean = ('total_income','mean'), total_income_median = ('total_income', 'median')).round()

                total_income_mean  total_income_median
age_categories
0-25                      23598.0              21478.0
25-45                     28156.0              24521.0
45-75                     25605.0              22112.0

In [225]:
# Let's look at the mean and median values for income based on the income_type factor
credit_data_notnull.groupby('income_type').agg({'total_income':['mean','median']}).round(1)

                            total_income
                                    mean   median
income_type
business                         32386.8  27577.3
civil servant                    27343.7  24071.7
employee                         25820.8  22815.1
entrepreneur                     79866.1  79866.1
paternity / maternity leave       8612.7   8612.7
retiree                          21940.4  18962.3
student                          15712.3  15712.3
unemployed                       21014.4  21014.4

In [226]:
# Let's look at the mean and median values for income based on the education factor
credit_data_notnull.groupby('education').agg(total_income_mean = ('total_income','mean'), total_income_median = ('total_income', 'median')).round(1)

                     total_income_mean  total_income_median
education
bachelor's degree              33142.8              28054.5
graduate degree                27960.0              25161.6
primary education              21144.9              18742.0
secondary education            24594.5              21836.6
some college                   29045.4              25618.5

In [227]:
credit_data_notnull['total_income'].describe()

count     19351.000000
mean      26787.568355
std       16475.450632
min        3306.762000
25%       16488.504500
50%       23202.870000
75%       32549.611000
max      362496.645000
Name: total_income, dtype: float64

**We have a big gap between the highest and lowest income. The mean isn't a good typical value when the data  has serious outliers. The outliers that we have make the median a better indicator of the typical salary than the mean.**

In [228]:
#  Write a function that we will use for filling in missing values
credit_data['total_income']= credit_data['total_income'].fillna(credit_data.groupby(['income_type'])['total_income'].transform('median'))

In [229]:
# Check if it works
credit_data['total_income'].isna().sum()

0

In [230]:
# Check if we got any errors
credit_data.loc[12]

children                                 0
days_employed                          NaN
dob_years                               65
education              secondary education
education_id                             1
family_status            civil partnership
family_status_id                         1
gender                                   M
income_type                        retiree
debt                                     0
total_income                     18962.318
purpose                  to have a wedding
days_employed_years                   None
purpose_category                   wedding
age_categories                       45-75
Name: 12, dtype: object

Checking that the total number of values in this column matches the number of values in other ones.

In [231]:
# Checking the number of entries in the columns
credit_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   children             21454 non-null  int64
 1   days_employed        19351 non-null  float64
 2   dob_years            21454 non-null  int64
 3   education            21454 non-null  object
 4   education_id         21454 non-null  int64
 5   family_status        21454 non-null  object
 6   family_status_id     21454 non-null  int64
 7   gender               21454 non-null  object
 8   income_type          21454 non-null  object
 9   debt                 21454 non-null  int64
 10  total_income         21454 non-null  float64
 11  purpose              21454 non-null  object
 12  days_employed_years  19351 non-null  object
 13  purpose_category     21454 non-null  object
 14  age_categories       21454 non-null  object
dtypes: float64(2), int64(5), object(8)
memory usage: 2.5+ MB

###  Restoring values in `days_employed`

Let's think about the parameters that may help restore the missing values in this column. Eventually, we want to find out whether to use mean or median values for replacing missing values.

In [232]:
# Distribution of `days_employed` medians based on your identified parameters
credit_data.groupby(['income_type']).agg(days_employed_mean = ('days_employed', 'mean'))

                             days_employed_mean
income_type
business                              87.980183
civil servant                        141.662371
employee                              96.937467
entrepreneur                          21.702003
paternity / maternity leave          137.364998
retiree                            15208.478802
student                               24.114648
unemployed                         15267.235531

In [233]:
# Distribution of `days_employed` means based on your identified parameters
credit_data.groupby(['education']).agg(days_employed_mean = ('days_employed', 'mean'))

                     days_employed_mean
education
bachelor's degree           1765.642049
graduate degree             5055.151259
primary education           5430.851098
secondary education         3183.909266
some college                 860.693001

**The outliers are big enough to opt for median instead of mean**

In [234]:
# Let's write a function that calculates means or medians (depending on your decision) based on your identified parameter
def days_employed_median():
    print(credit_data['days_employed'].median())

In [235]:
# Check that the function works
days_employed_median()

91.42585695327897

In [236]:
# Apply function to the income_type
def days_employed_median():
    print(credit_data.groupby('income_type')['days_employed'].median())

In [237]:
# Check if function worked
days_employed_median()

income_type
business                          64.474259
civil servant                    112.057015
employee                          65.591784
entrepreneur                      21.702003
paternity / maternity leave      137.364998
retiree                        15217.221094
student                           24.114648
unemployed                     15267.235531
Name: days_employed, dtype: float64

In [238]:
# Replacing missing values
def days_employed_fillna():
    credit_data['days_employed']= credit_data['days_employed'].fillna(credit_data.groupby(['income_type'])['days_employed'].transform('median'))

In [239]:
days_employed_fillna()

In [240]:
# Check the entries in all columns - make sure we fixed all missing values
credit_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   children             21454 non-null  int64
 1   days_employed        21454 non-null  float64
 2   dob_years            21454 non-null  int64
 3   education            21454 non-null  object
 4   education_id         21454 non-null  int64
 5   family_status        21454 non-null  object
 6   family_status_id     21454 non-null  int64
 7   gender               21454 non-null  object
 8   income_type          21454 non-null  object
 9   debt                 21454 non-null  int64
 10  total_income         21454 non-null  float64
 11  purpose              21454 non-null  object
 12  days_employed_years  19351 non-null  object
 13  purpose_category     21454 non-null  object
 14  age_categories       21454 non-null  object
dtypes: float64(2), int64(5), object(8)
memory usage: 2.5+ MB

## Categorization of data

To answer the questions and test the hypotheses, we will work with categorized data. 

Let's think about which of the data will need to be categorized to answer these questions.

In [241]:
# Printing the values for the selected data for categorization
credit_data['family_status']

0                  married
1                  married
2                  married
3                  married
4        civil partnership
               ...
21449    civil partnership
21450              married
21451    civil partnership
21452              married
21453              married
Name: family_status, Length: 21454, dtype: object

Let's check unique values

In [242]:
# Check the unique values
credit_data['family_status'].unique()

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

In [243]:
# Looking through all the numerical data in your selected column for categorization
print(credit_data['children'])

0        1
1        1
2        0
3        3
4        0
        ..
21449    1
21450    0
21451    1
21452    3
21453    2
Name: children, Length: 21454, dtype: int64

In [244]:
# Getting summary statistics for the column
credit_data['children'].describe()

count    21454.000000
mean         0.480563
std          0.756069
min          0.000000
25%          0.000000
50%          0.000000
75%          1.000000
max          5.000000
Name: children, dtype: float64

Deciding what ranges will be used for grouping.

In [245]:
# Creating function for categorizing into different numerical groups based on ranges
def children_cat (num):
    if num == 0:
        return 'No children'
    elif 1 <= num <= 2:
        return '1-2'
    else: 
        return'3 or more'

In [246]:
# Creating column with categories
credit_data['children_category'] = credit_data['children'].apply(children_cat)

In [247]:
# Count each categories values to see the distribution
credit_data['children_category'].value_counts()

children_category
No children    14091
1-2             6983
3 or more        380
Name: count, dtype: int64

## Checking the Hypotheses

**Is there a correlation between having children and paying back on time?**

In [250]:
# Check the children data and paying back on time


children_data_nodebt = pd.DataFrame()
children_data_nodebt = credit_data.loc[credit_data['debt']==0]

display(children_data_nodebt.groupby(['children_category'])['debt'].value_counts())


# Calculating default-rate based on the number of children
children_data_debt =credit_data.groupby(['children_category'])['debt'].value_counts(normalize=True).map('{:.2%}'.format).sort_values()
display(children_data_debt)

children_category  debt
1-2                0        6336
3 or more          0         349
No children        0       13028
Name: count, dtype: int64

children_category  debt
No children        1        7.54%
3 or more          1        8.16%
1-2                1        9.27%
                   0       90.73%
3 or more          0       91.84%
No children        0       92.46%
Name: proportion, dtype: object

In [262]:
pivot_table = credit_data.pivot_table(index='children_category', values='debt', aggfunc=['count', 'sum', 'mean'])
pivot_table.columns = ['count','default_payments','default_rate']
display(pivot_table)

                   count  default_payments  default_rate
children_category
1-2                 6983               647      0.092654
3 or more            380                31      0.081579
No children        14091              1063      0.075438

**Conclusion**

The default rate data shows that there is a very insignificant difference among those who have kids and those who haven't. It all comes down to roughly 1,5 percentage points. Therefore, there is no correlation between having children and paying back on time.

**Is there a correlation between family status and paying back on time?**

In [82]:
# Check the family status data and paying back on time
credit_data.groupby(['family_status'])['debt'].value_counts()


# Calculating default-rate based on family status
credit_data.groupby(['family_status'])['debt'].value_counts(normalize=True).map('{:.2%}'.format).sort_values()

family_status      debt
widow / widower    1        6.57%
divorced           1        7.11%
married            1        7.55%
civil partnership  1        9.35%
unmarried          1        9.75%
                   0       90.25%
civil partnership  0       90.65%
married            0       92.45%
divorced           0       92.89%
widow / widower    0       93.43%
Name: proportion, dtype: object

**Conclusion**

Those customers who are married are more likely fail to pay back on time by roughly 1.4 persentage points.

**Is there a correlation between income level and paying back on time?**

In [83]:
#First, we need to categorize total_income to make default analysis easier
def income_group (total_income):
    if total_income < 15000:
        return 'low'
    elif total_income <25000:
        return 'lower-middle'
    elif total_income <35000:
        return 'upper-middle'
    else:
        return 'high'

credit_data['income_group']= credit_data['total_income'].apply(income_group)

In [84]:
# Check the income level data and paying back on time
credit_data.groupby(['income_group'])['debt'].value_counts()



# Calculating default-rate based on income level
credit_data.groupby(['income_group'])['debt'].value_counts(normalize=True).map('{:.1%}'.format).sort_values()

income_group  debt
high          1        7.1%
low           1        8.0%
upper-middle  1        8.2%
lower-middle  1        8.6%
              0       91.4%
upper-middle  0       91.8%
low           0       92.0%
high          0       92.9%
Name: proportion, dtype: object

**Conclusion**
The high income customers, althoght slightly, but are less likely to default payments.

**How does credit purpose affect the default rate?**

In [85]:
# Check the percentages for default rate for each credit purpose and analyze them
credit_data.groupby(['purpose_category'])['debt'].value_counts(normalize=True).map('{:.1%}'.format).sort_values()

purpose_category  debt
house             1        7.2%
wedding           1        8.0%
education         1        9.2%
car               1        9.4%
                  0       90.6%
education         0       90.8%
wedding           0       92.0%
house             0       92.8%
Name: proportion, dtype: object

**Conclusion**

Those customers that have real estate related loan purpose are the most reliable.

## General Conclusion 

**Missing values**
First of all, we checked whether the dataframe has any flaws. 
Then, having found that there are both missing and erroneous values in columns days_employed and total_income we decided to go through all columns of the dataframe to check if everything is fine. 
- We fixed spelling in the education column and children column by applying the .abs() method (thus turning the negative values into the absolute values), while assuming that the -1 values were added to the dataframe by mistake.
- In days_employed column there were both a lot of negative and enormous values which we eventually decided to turn into positive values and divide by 24, assuming, that they represent hours, not days.
- In the gender column it was decided to get rid of XNA value, reason being that there was only one of them and it would make futher data analysis and manipulation a lot easier.
Next, we dealt with duplicates by dropping them and resetting the index.

**Restoring missing values**

To begin with, we categorized the purpose column to make it easier for us to analyse loan purpose affecting the default rate at the end of the project.
Then, we categorized age column to meake it possible to see the income distribution later in a table without missing values.
Afterwards, we looked at total_income distribution by mean and median in age, income_type, education columns
Eventually, we filled missing values with customers' median income by their income type.

With regards to days_employed column, we checked the distribution of `days_employed` medians based on income_type,education columns and then filled the missing values with the median values depending on income_type.

**Categorization**

To answer the questions and test the hypotheses, we categorized the family_status and children columns and added the new categorized columns to the dataframe.

**Checking the hypotheses**

**Conclusion 1. There is no correlation between having children and paying back on time**


The default rate data shows that there is a very insignificant difference among those who have kids and those who haven't. It all comes down to roughly 1,5 percentage points. Therefore, there is no correlation between having children and paying back on time.

**Conclusion 2. There is correlation between between family status and paying back on time**


Those customers who are married are more likely fail to pay back on time by roughly 1.4 persentage points.

**Conclusion 3. There is correlation between between income level and paying back on time**


The high income customers, althoght slightly, but are less likely to default payments.

**Conclusion 3. There is correlation between between loan purpose and paying back on time**

Those customers that have real estate related loan purpose are the most reliable.